public_html/karakeep_docker.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-03-20 vie 13:37 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Karakeep Docker</title>
<meta name="author" content="Sherlockes" />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' type='text/css' href='https://gongzhitaao.org/orgcss/org.css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Karakeep Docker</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org5657f0a">1. Info</a></li>
<li><a href="#org6640b26">2. Uso</a></li>
<li><a href="#orgd6341f3">3. Enlace</a></li>
<li><a href="#orgdfae63e">4. Variables de entorno (.env)</a></li>
<li><a href="#orga675895">5. Volúmenes</a></li>
<li><a href="#org6ff3e95">6. docker-compose.yml</a></li>
<li><a href="#org404a159">7. Gestión</a></li>
</ul>
</div>
</div>
<div id="outline-container-org5657f0a" class="outline-2">
<h2 id="org5657f0a"><span class="section-number-2">1.</span> Info</h2>
<div class="outline-text-2" id="text-1">
<p>
Karakeep es una aplicación open source “Bookmark Everything” que te permite guardar enlaces, notas, imágenes y archivos en un solo lugar con soporte para autoetiquetado basado en IA, buscador de texto completo y organización por listas. Está diseñada para ser self-hosted, con clientes web y extensiones para navegador, además de apps móviles. Karakeep descarga automáticamente títulos, descripciones e imágenes de tus marcadores, soporta RSS, importación desde otros servicios y ofrece API REST y clientes múltiples. También incluye funciones avanzadas como OCR, archivado completo de páginas y sincronización de marcadores. La documentación cubre instalación, configuración y opciones avanzadas.
</p>
</div>
</div>

<div id="outline-container-org6640b26" class="outline-2">
<h2 id="org6640b26"><span class="section-number-2">2.</span> Uso</h2>
<div class="outline-text-2" id="text-2">
<p>
Uso Karakeep para guardar los enlaces interesantes organizados por tags
</p>
</div>
</div>

<div id="outline-container-orgd6341f3" class="outline-2">
<h2 id="orgd6341f3"><span class="section-number-2">3.</span> Enlace</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="https://karakeep.app">https://karakeep.app</a></li>
<li><a href="https://karakeep.zgz.sherblog.es">https://karakeep.zgz.sherblog.es</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgdfae63e" class="outline-2">
<h2 id="orgdfae63e"><span class="section-number-2">4.</span> Variables de entorno (.env)</h2>
<div class="outline-text-2" id="text-4">
<p>
Hay que crear un par de cadenas aleatorias con el comando <code>openssl rand -base64 36</code> y el archivo queda así
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #cae682;">KARAKEEP_VERSION</span>=release
<span style="color: #cae682;">NEXTAUTH_SECRET</span>=************************************************
<span style="color: #cae682;">MEILI_MASTER_KEY</span>=************************************************
<span style="color: #cae682;">NEXTAUTH_URL</span>=http://192.168.10.211:3000
</pre>
</div>
</div>
</div>

<div id="outline-container-orga675895" class="outline-2">
<h2 id="orga675895"><span class="section-number-2">5.</span> Volúmenes</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>~/dockers/karakeep/data - Enlaces, info y configuración</li>
</ul>
</div>
</div>

<div id="outline-container-org6ff3e95" class="outline-2">
<h2 id="org6ff3e95"><span class="section-number-2">6.</span> docker-compose.yml</h2>
<div class="outline-text-2" id="text-6">
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #cae682;">services</span>:
  <span style="color: #cae682;">web</span>:
    <span style="color: #cae682;">image</span>: ghcr.io/karakeep-app/karakeep:${KARAKEEP_VERSION:-release}
    <span style="color: #cae682;">restart</span>: unless-stopped
    <span style="color: #cae682;">volumes</span>:
      - ~/dockers/karakeep/data:/data
    <span style="color: #cae682;">ports</span>:
      - 3000:3000
    <span style="color: #cae682;">env_file</span>:
      - .env
    <span style="color: #cae682;">environment</span>:
      <span style="color: #cae682;">MEILI_ADDR</span>: http://meilisearch:7700
      <span style="color: #cae682;">BROWSER_WEB_URL</span>: http://chrome:9222
      <span style="color: #cae682;">DATA_DIR</span>: /data <span style="color: #99968b;"># </span><span style="color: #99968b;">DON'T CHANGE THIS
</span>  <span style="color: #cae682;">chrome</span>:
    <span style="color: #cae682;">image</span>: gcr.io/zenika-hub/alpine-chrome:124
    <span style="color: #cae682;">restart</span>: unless-stopped
    <span style="color: #cae682;">command</span>:
      - --no-sandbox
      - --disable-gpu
      - --disable-dev-shm-usage
      - --remote-debugging-address=0.0.0.0
      - --remote-debugging-port=9222
      - --hide-scrollbars
  <span style="color: #cae682;">meilisearch</span>:
    <span style="color: #cae682;">image</span>: getmeili/meilisearch:v1.13.3
    <span style="color: #cae682;">restart</span>: unless-stopped
    <span style="color: #cae682;">env_file</span>:
      - .env
    <span style="color: #cae682;">environment</span>:
      <span style="color: #cae682;">MEILI_NO_ANALYTICS</span>: <span style="color: #95e454;">"true"</span>
    <span style="color: #cae682;">volumes</span>:
      - meilisearch:/meili_data

<span style="color: #cae682;">volumes</span>:
  <span style="color: #cae682;">meilisearch</span>:
  <span style="color: #cae682;">data</span>:
</pre>
</div>
</div>
</div>

<div id="outline-container-org404a159" class="outline-2">
<h2 id="org404a159"><span class="section-number-2">7.</span> Gestión</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">
<pre class="src src-bash">docker compose up -d
docker compose logs -f 
docker compose restart 
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2026-01-05</p>
<p class="author">Author: Sherlockes</p>
<p class="date">Created: 2026-03-20 vie 13:37</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
